[
    {
        "name": "Single Leg Butt Kick",
        "force": "push",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "body only",
        "primaryMuscles": [
            "quadriceps"
        ],
        "secondaryMuscles": [
            "calves",
            "hamstrings"
        ],
        "instructions": [
            "Begin by standing on one leg, with the bent knee raised. This will be your start position.",
            "Using a countermovement jump, take off upward by extending the hip, knee, and ankle of the grounded leg.",
            "Immediately flex the knee and attempt to touch your butt with the heel of your jumping leg.",
            "Return the leg to a partially bent position underneath the hips and land. Your opposite leg should stay in relatively the same position throughout the drill."
        ],
        "category": "plyometrics",
        "images": [
            "Single_Leg_Butt_Kick/0.jpg",
            "Single_Leg_Butt_Kick/1.jpg"
        ],
        "id": "Single_Leg_Butt_Kick"
    },
    {
        "name": "Single Leg Glute Bridge",
        "force": "push",
        "level": "beginner",
        "mechanic": "isolation",
        "equipment": "body only",
        "primaryMuscles": [
            "glutes"
        ],
        "secondaryMuscles": [
            "hamstrings"
        ],
        "instructions": [
            "Lay on the floor with your feet flat and knees bent.",
            "Raise one leg off of the ground, pulling the knee to your chest. This will be your starting position.",
            "Execute the movement by driving through the heel, extending your hip upward and raising your glutes off of the ground.",
            "Extend as far as possible, pause and then return to the starting position."
        ],
        "category": "strength",
        "images": [
            "Single_Leg_Glute_Bridge/0.jpg",
            "Single_Leg_Glute_Bridge/1.jpg"
        ],
        "id": "Single_Leg_Glute_Bridge"
    },
    {
        "name": "Single Leg Push-off",
        "force": "push",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "other",
        "primaryMuscles": [
            "quadriceps"
        ],
        "secondaryMuscles": [
            "calves",
            "hamstrings"
        ],
        "instructions": [
            "Stand on the ground with one foot resting on the box, heel close to the edge.",
            "Push off with your foot on top of the box, trying to gain as much height as possible by extending through the hip and knee.",
            "Land with the same foot on top of the box, returning your other foot back to the start position."
        ],
        "category": "plyometrics",
        "images": [
            "Single_Leg_Push-off/0.jpg",
            "Single_Leg_Push-off/1.jpg"
        ],
        "id": "Single_Leg_Push-off"
    },
    {
        "name": "Leg Pull-In",
        "force": "pull",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "body only",
        "primaryMuscles": [
            "abdominals"
        ],
        "secondaryMuscles": [],
        "instructions": [
            "Lie on an exercise mat with your legs extended and your hands either palms facing down next to you or under your glutes. Tip: My preference is with the hands next to me. This will be your starting position.",
            "Bend your knees and pull your upper thighs into your midsection as you breathe out. Continue the motion until your knees are around chest level. Contract your abs as you execute this movement and hold for a second at the top. Tip: As you perform the motion, the lower legs (calves) should always remain parallel to the floor.",
            "Return to the starting position as you inhale.",
            "Repeat for the recommended amount of repetitions."
        ],
        "category": "strength",
        "images": [
            "Leg_Pull-In/0.jpg",
            "Leg_Pull-In/1.jpg"
        ],
        "id": "Leg_Pull-In"
    },
    {
        "name": "Plank",
        "force": "static",
        "level": "beginner",
        "mechanic": "isolation",
        "equipment": "body only",
        "primaryMuscles": [
            "abdominals"
        ],
        "secondaryMuscles": [],
        "instructions": [
            "Get into a prone position on the floor, supporting your weight on your toes and your forearms. Your arms are bent and directly below the shoulder.",
            "Keep your body straight at all times, and hold this position as long as possible. To increase difficulty, an arm or leg can be raised."
        ],
        "category": "strength",
        "images": [
            "Plank/0.jpg",
            "Plank/1.jpg"
        ],
        "id": "Plank"
    },
    {
        "name": "Butt Lift (Bridge)",
        "force": "push",
        "level": "beginner",
        "mechanic": "isolation",
        "equipment": "body only",
        "primaryMuscles": [
            "glutes"
        ],
        "secondaryMuscles": [
            "hamstrings"
        ],
        "instructions": [
            "Lie flat on the floor on your back with the hands by your side and your knees bent. Your feet should be placed around shoulder width. This will be your starting position.",
            "Pushing mainly with your heels, lift your hips off the floor while keeping your back straight. Breathe out as you perform this part of the motion and hold at the top for a second.",
            "Slowly go back to the starting position as you breathe in."
        ],
        "category": "strength",
        "images": [
            "Butt_Lift_Bridge/0.jpg",
            "Butt_Lift_Bridge/1.jpg"
        ],
        "id": "Butt_Lift_Bridge"
    },
    {
        "name": "See-Saw Press (Alternating Side Press)",
        "force": "push",
        "level": "intermediate",
        "mechanic": "compound",
        "equipment": "dumbbell",
        "primaryMuscles": [
            "shoulders"
        ],
        "secondaryMuscles": [
            "abdominals",
            "triceps"
        ],
        "instructions": [
            "Grab a dumbbell with each hand and stand up erect.",
            "Clean (lift) the dumbbells to the chest/shoulder level and then rotate your wrists so that your palms are facing towards you as if you were getting ready to perform an Arnold Press. This will be your starting position.",
            "Now start extending your left arm overhead as you rotate the wrist so that the palm of your hand faces forward as you go up. Your elbows should come out also as you lift the weight. Simultaneously, you will also be bending from your hip to your opposite side. Tip: If you perform the exercise correctly, is should look as if you are trying to reach for something overhead on the right hand side of your body, but with your left arm. Breathe out as you perform this movement.",
            "Once you reach the top position breathe in. Then, with the weight fully extended overhead and you bent over to your right hand side, begin the movement to the left side.",
            "Repeat for the recommended amount of repetitions."
        ],
        "category": "strength",
        "images": [
            "See-Saw_Press_Alternating_Side_Press/0.jpg",
            "See-Saw_Press_Alternating_Side_Press/1.jpg"
        ],
        "id": "See-Saw_Press_Alternating_Side_Press"
    },
    {
        "name": "Scissors Jump",
        "force": "push",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "body only",
        "primaryMuscles": [
            "quadriceps"
        ],
        "secondaryMuscles": [
            "glutes",
            "hamstrings"
        ],
        "instructions": [
            "Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.",
            "Ensure that the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift.",
            "As you jump as high as you can, switch the position of your legs, moving your front leg to the back and the rear leg to the front.",
            "As you land, absorb the impact through the legs by adopting the lunge position, and repeat."
        ],
        "category": "plyometrics",
        "images": [
            "Scissors_Jump/0.jpg",
            "Scissors_Jump/1.jpg"
        ],
        "id": "Scissors_Jump"
    },
    {
        "name": "Side Leg Raises",
        "force": "pull",
        "level": "beginner",
        "mechanic": null,
        "equipment": "body only",
        "primaryMuscles": [
            "adductors"
        ],
        "secondaryMuscles": [],
        "instructions": [
            "Stand next to a chair, which you may hold onto as a support. Stand on one leg. This will be your starting position.",
            "Keeping your leg straight, raise it as far out to the side as possible, and swing it back down, allowing it to cross the opposite leg.",
            "Repeat this swinging motion 5-10 times, increasing the range of motion as you do so."
        ],
        "category": "stretching",
        "images": [
            "Side_Leg_Raises/0.jpg",
            "Side_Leg_Raises/1.jpg"
        ],
        "id": "Side_Leg_Raises"
    },
    {
        "name": "Hip Circles (prone)",
        "force": "pull",
        "level": "beginner",
        "mechanic": "isolation",
        "equipment": "body only",
        "primaryMuscles": [
            "abductors"
        ],
        "secondaryMuscles": [
            "adductors"
        ],
        "instructions": [
            "Position yourself on your hands and knees on the ground. Maintaining good posture, raise one bent knee off of the ground. This will be your starting position.",
            "Keeping the knee in a bent position, rotate the femur in an arc, attempting to make a big circle with your knee.",
            "Perform this slowly for a number of repetitions, and repeat on the other side."
        ],
        "category": "stretching",
        "images": [
            "Hip_Circles_prone/0.jpg",
            "Hip_Circles_prone/1.jpg"
        ],
        "id": "Hip_Circles_prone"
    },
    {
        "name": "Flutter Kicks",
        "force": "pull",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "body only",
        "primaryMuscles": [
            "glutes"
        ],
        "secondaryMuscles": [
            "hamstrings"
        ],
        "instructions": [
            "On a flat bench lie facedown with the hips on the edge of the bench, the legs straight with toes high off the floor and with the arms on top of the bench holding on to the front edge.",
            "Squeeze your glutes and hamstrings and straighten the legs until they are level with the hips. This will be your starting position.",
            "Start the movement by lifting the left leg higher than the right leg.",
            "Then lower the left leg as you lift the right leg.",
            "Continue alternating in this manner (as though you are doing a flutter kick in water) until you have done the recommended amount of repetitions for each leg. Make sure that you keep a controlled movement at all times. Tip: You will breathe normally as you perform this movement."
        ],
        "category": "strength",
        "images": [
            "Flutter_Kicks/0.jpg",
            "Flutter_Kicks/1.jpg"
        ],
        "id": "Flutter_Kicks"
    },
    {
        "name": "Downward Facing Balance",
        "force": "static",
        "level": "intermediate",
        "mechanic": "isolation",
        "equipment": "exercise ball",
        "primaryMuscles": [
            "glutes"
        ],
        "secondaryMuscles": [
            "abdominals",
            "hamstrings"
        ],
        "instructions": [
            "Lie facedown on top of an exercise ball.",
            "While resting on your stomach on the ball, walk your hands forward along the floor and lift your legs, extending your elbows and knees."
        ],
        "category": "strength",
        "images": [
            "Downward_Facing_Balance/0.jpg",
            "Downward_Facing_Balance/1.jpg"
        ],
        "id": "Downward_Facing_Balance"
    },
    {
        "name": "Balance Board",
        "force": null,
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "other",
        "primaryMuscles": [
            "calves"
        ],
        "secondaryMuscles": [
            "hamstrings",
            "quadriceps"
        ],
        "instructions": [
            "Place a balance board in front of you.",
            "Stand up on it and try to balance yourself.",
            "Hold the balance for as long as desired."
        ],
        "category": "strength",
        "images": [
            "Balance_Board/0.jpg",
            "Balance_Board/1.jpg"
        ],
        "id": "Balance_Board"
    },
    {
        "name": "Star Jump",
        "force": "push",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "body only",
        "primaryMuscles": [
            "quadriceps"
        ],
        "secondaryMuscles": [
            "calves",
            "glutes",
            "hamstrings",
            "shoulders"
        ],
        "instructions": [
            "Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.",
            "To initiate the move, squat down halfway and explode back up as high as possible. Fully extend your entire body, spreading your legs and arms away from the body.",
            "As you land, bring your limbs back in and absorb your impact through the legs."
        ],
        "category": "plyometrics",
        "images": [
            "Star_Jump/0.jpg",
            "Star_Jump/1.jpg"
        ],
        "id": "Star_Jump"
    },
    {
        "name": "Lateral Box Jump",
        "force": "push",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "other",
        "primaryMuscles": [
            "adductors"
        ],
        "secondaryMuscles": [
            "abductors",
            "calves",
            "glutes",
            "hamstrings",
            "quadriceps"
        ],
        "instructions": [
            "Assume a comfortable standing position, with a short box positioned next to you. This will be your starting position.",
            "Quickly dip into a quarter squat to initiate the stretch reflex, and immediately reverse direction to jump up and to the side.",
            "Bring your knees high enough to ensure your feet have good clearance over the box.",
            "Land on the center of the box, using your legs to absorb the impact.",
            "Carefully jump down to the other side of the box, and continue going back and forth for several repetitions."
        ],
        "category": "plyometrics",
        "images": [
            "Lateral_Box_Jump/0.jpg",
            "Lateral_Box_Jump/1.jpg"
        ],
        "id": "Lateral_Box_Jump"
    },
    {
        "name": "Neck Press",
        "force": "push",
        "level": "intermediate",
        "mechanic": "compound",
        "equipment": "barbell",
        "primaryMuscles": [
            "chest"
        ],
        "secondaryMuscles": [
            "shoulders",
            "triceps"
        ],
        "instructions": [
            "Lie back on a flat bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position.",
            "As you breathe in, come down slowly until you feel the bar on your neck.",
            "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).",
            "Repeat the movement for the prescribed amount of repetitions.",
            "When you are done, place the bar back in the rack."
        ],
        "category": "strength",
        "images": [
            "Neck_Press/0.jpg",
            "Neck_Press/1.jpg"
        ],
        "id": "Neck_Press"
    },
    {
        "name": "Weighted Ball Side Bend",
        "force": "pull",
        "level": "intermediate",
        "mechanic": "isolation",
        "equipment": "exercise ball",
        "primaryMuscles": [
            "abdominals"
        ],
        "secondaryMuscles": [],
        "instructions": [
            "To begin, lie down on an exercise ball with your left side of the torso (waist, hips and shoulder) pressed against the ball.",
            "Your feet should be on the floor while your legs are crossed and hanging from the ball. Hold a weighted plate with your right hand directly to the right side of your head. Tip: Make sure the smooth side of the plate is resting against your head.",
            "Place your left arm across your torso so that your palm is on your obliques. There should be a right angle between your left forearm and upper arm. This is the starting position.",
            "Raise the side of your torso up by laterally flexing at the waist while exhaling.",
            "Hold the contraction for a second and slowly lower yourself back down to the starting position while inhaling.",
            "Repeat for the recommended amount of repetitions.",
            "Switch sides and repeat the exercise."
        ],
        "category": "strength",
        "images": [
            "Weighted_Ball_Side_Bend/0.jpg",
            "Weighted_Ball_Side_Bend/1.jpg"
        ],
        "id": "Weighted_Ball_Side_Bend"
    },
    {
        "name": "Dumbbell Side Bend",
        "force": "pull",
        "level": "beginner",
        "mechanic": "isolation",
        "equipment": "dumbbell",
        "primaryMuscles": [
            "abdominals"
        ],
        "secondaryMuscles": [],
        "instructions": [
            "Stand up straight while holding a dumbbell on the left hand (palms facing the torso) as you have the right hand holding your waist. Your feet should be placed at shoulder width. This will be your starting position.",
            "While keeping your back straight and your head up, bend only at the waist to the right as far as possible. Breathe in as you bend to the side. Then hold for a second and come back up to the starting position as you exhale. Tip: Keep the rest of the body stationary.",
            "Now repeat the movement but bending to the left instead. Hold for a second and come back to the starting position.",
            "Repeat for the recommended amount of repetitions and then change hands."
        ],
        "category": "strength",
        "images": [
            "Dumbbell_Side_Bend/0.jpg",
            "Dumbbell_Side_Bend/1.jpg"
        ],
        "id": "Dumbbell_Side_Bend"
    },
    {
        "name": "Front Leg Raises",
        "force": "pull",
        "level": "beginner",
        "mechanic": null,
        "equipment": "body only",
        "primaryMuscles": [
            "hamstrings"
        ],
        "secondaryMuscles": [],
        "instructions": [
            "Stand next to a chair or other support, holding on with one hand.",
            "Swing your leg forward, keeping the leg straight. Continue with a downward swing, bringing the leg as far back as your flexibility allows. Repeat 5-10 times, and then switch legs."
        ],
        "category": "stretching",
        "images": [
            "Front_Leg_Raises/0.jpg",
            "Front_Leg_Raises/1.jpg"
        ],
        "id": "Front_Leg_Raises"
    }
]